{
  "data":[
     {
        "id":"1",
        "title":"Peanut Butter Cookies",
        "pictureURL":"https://static.mojewypieki.com/wp-content/uploads/2020/03/ciastka_orzechowe_z_choc_chips_1_1_of_1.jpg",
        "introduction":"Best cookies ever!",
        "form-shape":"",
        "form-size":"",
        "header1":"",
        "ingredients1":"250 g flour\n1 ts soda\n300 g peanut butter\n60 g butter (room temperature)\n220 g brown sugar\n2 eggs\n2 ts vanilla sugar\n150 g chocolate chips/chopped chocolate (milk or dark it's up to you)",
        "directions1":"Beat butter, peanut butter, and sugar (with vanilla sugar) using a mixer. Add eggs one by one, mixing all the time. Add flour with soda and mix again. In the end, add chocolate and stir.\nForm small balls, you can use an ice cream spoon, put it on a baking plate lined with baking paper. Leave around 3 cm distance between cookies. Bake at 180ºC for 13-15 minutes till they get slightly brown. Cool on a wire rack.",
        "header2":"",
        "ingredients2":"",
        "directions2":"",
        "disclamer":"~Orginal recipe from www.mojewypieki.com."
     },
     {
        "id":"2",
        "title":"White Chocolate-Strawberry Cake",
        "pictureURL":"https://static.mojewypieki.com/wp-content/uploads/2020/03/IMG_2366.jpg",
        "introduction":"Not really cake, not really not-cake. Freaking delicious",
        "form-shape":"round",
        "form-size":"23",
        "header1":"Ingredients for the cake:",
        "ingredients1":"250 g of white chocolate\n250 ml of full cream\n5 eggs\n80 g of sugar\n2 ts of vanilla sugar\n250 g of mascarpone\n1 cup of ground almonds\n250 g of strawberries (can be frozen)",
        "directions1":"Pour cream to a small pot, add white chocolate and hit stirring till the moment chocolate is completely melted. Put the pot aside.\nSeparate whites and yolks.\nBeat (use mixer) yolks with half of the sugar and vanilla sugar till it gets bright, fluffy. Add mascarpone, almonds, and melted chocolate, mix it.\nBeat whites with the rest of the sugar and combine it carefully with the batter.\nPrepare a springform pan (diameter of 23 cm) by lining its bottom with baking paper. Pour the batter into it and add strawberries (you can cut them into smaller pieces if you want).\nBake in 175ºC for 60 minutes, on the top of the cake put a piece of aluminum foil so it will not get burned. Cooldown the cake in the oven with half-open doors, then put it in the fridge for at least 4 hours. Do not worry when the cake grows and falls, it's the way it should be.",
        "header2":"Ingredients for the filling:",
        "ingredients2":"250 ml of full cream\n2 tbs of powder sugar\n100 g of strawberries (have to be unfreeze)\n2 ts of gelatin\n2 tbs of hot water",
        "directions2":"Melt the gelatin in hot water. Wipe cream, at the end add powder sugar and strawberries. When the cream is ready add gelatin and mix it immediately with a mixer. Fill the hole in the center of the cake with wiped cream. Leave the cake in a fridge for about 30 minutes.",
        "disclamer":"~Orginal recipe from www.mojewypieki.com."
     },
     {
        "id":"3",
        "title":"Wholemeal Chocolate Cake with Cherry Jam",
        "pictureURL":"https://static.mojewypieki.com/wp-content/uploads/2020/03/razowe_ciasto_czekoladowe_2.jpg",
        "introduction":"Wholemeal so healthy!",
        "form-shape":"round",
        "form-size":"23",
        "header1":"Ingredients for the cake:",
        "ingredients1":"250 g of white chocolate\n250 ml of full cream\n5 eggs\n80 g of sugar\n2 ts of vanilla sugar\n250 g of mascarpone\n1 cup of ground almonds\n250 g of strawberries (can be frozen)",
        "directions1":"Melt chocolate in the microwave or water bath.\nFlour, cacao, soda, salt sift. Mix sugar with vanilla sugar.\nBeat butter with a mixer, at the end, add sugar in bathes and eggs one by one, mixing all the time. Pour melted chocolate and beat with a mixer. Add alternately tablespoon of flour and a bit of sour cream mixing well to the point all ingredients are combined. At the very end pour boiling water and stir.\nPour the batter into the springform pan (diameter of 23 cm) lined with baking paper. Bake at 190ºC for 30-40 minutes till the moment when the toothpick inserted in the center of the cake doesn't have marks of a raw batter.\nWhen the cake is cold you can spread cherry jam at the top like I did or use something else. In the end, cover it with the chocolate ganache.",
        "header2":"Ingredients for the ganache:",
        "ingredients2":"40 g unsalted butter\n100 g dark chocolate (minimum 50% of cacao)",
        "directions2":"Melt butter in a small pot, add broken chocolate, and heat it slowly stirring from time to time till ingredients are fully connected.\nDecorate the cake.",
        "disclamer":"~Orginal recipe from www.mojewypieki.com."
     },
     {
        "id":"4",
        "title":"Banofee Pie",
        "pictureURL":"https://saltandbaker.com/wp-content/uploads/2018/11/Banofee-Pie-5.jpg",
        "introduction":"Bananas, dolce de leite, cookies, who would resist?",
        "form-shape":"round",
        "form-size":"23",
        "header1":"Ingredients for the bottom layer:",
        "ingredients1":"85 g of melted butter or margarine\n150 g of crushed digestive cookies\n25 g of grounded almonds\n25 g of grounded hazelnuts",
        "directions1":"Mix all the ingredients together, place it at the bottom of the quiche form/springform 23 cm in diameter.\nBake in the preheated oven - 180°C for about 10 minutes. Let the bottom cool down by the time you put on the next layer.",
        "header2":"Ingredients for the top layer:",
        "ingredients2":"800 g dulce de leite - you can make it by boiling a can of condensed milk for two hours under cover\n4 ripe bananas\njuice from 0.5 of lemon\n1 spoon of vanilla essence\n75 g of dark chocolate, grated\n500 ml of whipping cream",
        "directions2":"Peel the bananas cut them into slices. Lemon juice and vanilla essence mix and add to bananas. Spread the bananas at the bottom and cover with toffee from the cans. Sprinkle 50 g of chocolate over it.\nWhisk the cream and put it at the top. Use the rest of the chocolate for decoration.\nYou can leave the dessert for a couple of hours in the fridge so it can get stiffer but you can as well just eat it all immediately.",
        "disclamer":"~Orginal recipe from www.mojewypieki.com."
     },
     {
        "id":"5",
        "title":"Coconut Banana Bread",
        "pictureURL":"https://static.mojewypieki.com/wp-content/uploads/2020/03/bochenek_z_zurawinami_Nigelli_20_400x400.jpg",
        "introduction":"Mmmm, banana bread...",
        "form-shape":"rectangular",
        "form-size":"25x10",
        "header1":"",
        "ingredients1":"115 g butter\n130 g sugar\n2 eggs, beaten\n3 medium-size bananas, mashed\n200 g wheat flour\n1 tsp baking soda\n1 tsp baking powder\n1/2 tsp salt\n1/2 tsp vanilla sugar\n80 g white chocolate\n50 g desiccated coconut\n50g dried cranberries",
        "directions1":"Cream butter and sugar together until you get a smooth emulsion. Add eggs, one by one, mix it well after adding each egg. Add bananas, chocolate, coconut, mix it well.\nIn a separate bowl mix flour with soda and baking powder. Add it to the buttery mixture and stir until all the ingredients are thoroughly combined.\nBake in preheated oven - 180°C for about 55 minutes. Use loaf mold, 10x25cm, lined with baking paper.",
        "header2":"",
        "ingredients2":"",
        "directions2":"",
        "disclamer":"~Based on a recipe by Nigella Lawson"
     },
     {
        "id":"6",
        "title":"Dundee Cake",
        "pictureURL":"https://static.mojewypieki.com/wp-content/uploads/2020/03/dundee_cake_0.jpg",
        "introduction":"Scotish Christmas classic.",
        "form-shape":"round",
        "form-size":"",
        "header1":"",
        "ingredients1":"150 g of butter (room temperature)\n150 g of fine sugar\n3 eggs (room temperature)\n225 g of flour\n1 ts of baking powder\n175 g of corinthian raisins/zante currants\n175 g of sultana raisins\n50 g of dried cranberries\n50 g of candied orange peel\n2 tbs of grounded almonds\npeel grated from 1 small orange\npeel grated from 1 small lemon\n100 g of blanched almonds",
        "directions1":"Beat the butter with a mixer, until it is fluffy. While mixing step by step add sugar, keep mixing until the mixture is light and fluffy (aka until it is creamed).\nTo the buttery mixture add eggs, one by one, mixing only until the ingredients are combined.\nSift flour with baking powder to a separate bowl and leave it aside.\nIn the next bowl combine Corinthian and sultana raisins, candied cherries and orange peel, grated peel from orange and lemon, grounded almonds. The almonds should prevent other ingredients from sticking together.\nAdd the flour to the creamed butter and mix it with a mixer. Add the sweetmeats and mix it in with a spatula.\nLine the bottom and sides of a springform pan (18-20 cm diameter) with a baking paper. Carefully place the batter in the form and level the surface. At the top put the blanched almonds, they should create a pattern of expanding circles like on the picture.\nBake the cake in an oven preheated to 160ºC for about 2-2,5 hours. The cake is ready when the cake tester comes out dry. Make sure to start checking the cake much earlier than 2 hours, sometimes it may take only 1,5 hours. When the cake is ready take it out of the oven and let it cool down. Only then you may take it out from the form.\nDundee cake stays good for a long time. It should be kept in a hermetic food container in a cool place. It gets better every day, so it is recommended to be baked a few days before serving. ",
        "header2":"",
        "ingredients2":"",
        "directions2":"",
        "disclamer":"~Based on a recipe by Nigella Lawson"
     },
     {
        "id":"7",
        "title":"Apple Crumble Cake",
        "pictureURL":"https://static.mojewypieki.com/wp-content/uploads/2020/03/Ciasto_z_jab%C5%82kami_i_orzechow%C4%85_kruszonk%C4%85_1.jpg",
        "introduction":"No chocolate cake generally suck, but this one is not back.",
        "form-shape":"round",
        "form-size":"27",
        "header1":"Ingredients for the base",
        "ingredients1":"120 g butter, soft\n180 g sugar\n220 g wheat flour\n1 tsp baking powder\n3 eggs\n4 Grannie Smith apples",
        "directions1":"",
        "header2":"Ingredients for the crumble",
        "ingredients2":"175 g wheat flour\n125 g sugar\n1 tsp vanilla sugar\n125 g Butter",
        "directions2":"Beat butter and sugar until creamy. Add eggs and mix well. Add the remaining ingredients, mix and spread in a form lined with baking paper.\nPeel, core and quarter the apples. Place the apple quarters tightly on the base.\nTo make the crumble, place all ingredients in a bowl and mix until desired size is reached. Cover the apples evenly.\nBake at 200 C - 45 min on a baking tray on lower third of oven.",
        "disclamer":"~Orginal recipe from Pastel de Nata cafe in Oslo."
     }
  ]
}